{
  "setup_pin_screen": {
    "enter_your_pin": "अपना PIN दर्ज करें",
    "enter_your_pin_restore": "वॉलेट को पुनर्स्थापित करने के लिए अपना PIN दर्ज करें",
    "enter_your_pin_create": "नया वॉलेट बनाने के लिए अपना PIN दर्ज करें",
    "enter_your_pin_unlock": "वॉलेट अनलॉक करने के लिए अपना PIN दर्ज करें",
    "reenter_your_pin": "अपना PIN फिर से दर्ज करें",
    "pin_mismatch": "PIN मेल नहीं खाता। कृपया पुनः प्रयास करें।",
    "failed_to_unlock": "वॉलेट को अनलॉक करने में विफल। पुनः प्रयास करें।",
    "failed_to_create": "वॉलेट बनाने में विफल। पुनः प्रयास करें।",
    "failed_to_restore": "वॉलेट को पुनर्स्थापित करने में विफल। पुनः प्रयास करें।",
    "unlocking_wallet": "वॉलेट अनलॉक किया जा रहा है...",
    "creating_wallet": "वॉलेट बनाया जा रहा है, कृपया प्रतीक्षा करें...",
    "restoring_wallet": "वॉलेट पुनर्स्थापित किया जा रहा है, कृपया प्रतीक्षा करें...",
    "confirm_wallet_deletion": "वॉलेट हटाने की पुष्टि करें",
    "delete_wallet_warning": "क्या आप वाकई इस वॉलेट को हटाना चाहते हैं? यह क्रिया पूर्ववत नहीं की जा सकती।",
    "cancel": "रद्द करें",
    "delete": "हटाएं",
    "remove_wallet": "वॉलेट हटाएं"
  },
  "terms_screen": {
    "title": "उपयोग की शर्तें",
    "terms_content": "KittyRun Wallet - नियम और शर्तें\n\n1. **विकेंद्रीकृत प्रकृति**: KittyRun Wallet एक नॉन-कस्टोडियल वॉलेट है। इसका मतलब है कि आप, उपयोगकर्ता, अपनी निजी कुंजियों और रिकवरी फ्रेज़ को प्रबंधित करने के लिए पूरी तरह जिम्मेदार हैं। हम आपकी निजी कुंजियों या धन तक पहुंच नहीं रखते हैं।\n\n2. **गोपनीयता**: एक विकेंद्रीकृत वॉलेट के रूप में, KittyRun Wallet किसी भी व्यक्तिगत जानकारी या लेन-देन डेटा को एकत्र या संग्रहीत नहीं करता है। आपकी सभी जानकारी आपके डिवाइस पर स्थानीय रूप से संग्रहीत होती है और हमारे सर्वर पर नहीं भेजी जाती है।\n\n3. **स्वयं-संरक्षण**: आप अपनी संपत्तियों के एकमात्र मालिक हैं। यदि आप अपनी निजी कुंजी या रिकवरी फ्रेज़ खो देते हैं, तो आप अपने धन तक पहुंच नहीं पाएंगे। यह आपकी जिम्मेदारी है कि आप अपनी निजी कुंजियों और रिकवरी फ्रेज़ को सुरक्षित रखें।\n\n4. **लेन-देन की जिम्मेदारी**: KittyRun Wallet के माध्यम से की गई सभी लेन-देन अपरिवर्तनीय हैं और उन्हें पूर्ववत नहीं किया जा सकता है। लेन-देन की पुष्टि से पहले विवरणों की जाँच करने के लिए आप पूरी तरह जिम्मेदार हैं।\n\n5. **सुरक्षा**: KittyRun Wallet आपके डिवाइस पर डेटा की सुरक्षा के लिए उद्योग-मानक एन्क्रिप्शन का उपयोग करता है। हालांकि, वॉलेट की सुरक्षा आपके डिवाइस की सुरक्षा पर भी निर्भर करती है। आप अपने डिवाइस को अनधिकृत पहुंच, मैलवेयर और अन्य सुरक्षा खतरों से सुरक्षित रखने के लिए जिम्मेदार हैं।\n\n6. **अपडेट्स**: हम सुरक्षा को बेहतर बनाने, बग्स को ठीक करने, या नई सुविधाओं को जोड़ने के लिए अपडेट जारी कर सकते हैं। यह अनुशंसा की जाती है कि आप अनुप्रयोग को नवीनतम संस्करण में अद्यतन रखें ताकि बेहतर प्रदर्शन और सुरक्षा सुनिश्चित हो सके।\n\n7. **कोई उत्तरदायित्व नहीं**: KittyRun Wallet और इसके डेवलपर्स किसी भी नुकसान, हानि, या खर्चों के लिए जिम्मेदार नहीं होंगे, जो वॉलेट के उपयोग या उपयोग करने में असमर्थता से उत्पन्न होते हैं, जिसमें धन की हानि, डेटा उल्लंघन, या आपके डिवाइस तक अनधिकृत पहुंच शामिल है।\n\n8. **शर्तों की स्वीकृति**: KittyRun Wallet का उपयोग करके, आप स्वीकार करते हैं कि आपने इन शर्तों को पढ़ा, समझा और सहमति दी है। यदि आप इन शर्तों में से किसी से असहमत हैं, तो आपको तुरंत वॉलेट का उपयोग बंद कर देना चाहिए।",
    "agree_to_terms": "मैं उपयोग की शर्तों से सहमत हूँ",
    "accept_button": "स्वीकार करें"
  },
  "wallet_choice_screen": {
    "title": "वॉलेट सेटअप",
    "choose_option": "अपना वॉलेट सेट करने के लिए एक विकल्प चुनें:",
    "create_new_wallet": "नया वॉलेट बनाएं",
    "import_mnemonic": "म्नेमोनिक आयात करें"
  },
  "import_mnemonic_screen": {
    "title": "म्नेमोनिक आयात करें",
    "enter_mnemonic": "अपना 12-शब्द म्नेमोनिक फ्रेज़ दर्ज करें:",
    "mnemonic_error": "अमान्य म्नेमोनिक फ्रेज़। कृपया ठीक 12 शब्द दर्ज करें।",
    "continue_button": "जारी रखें"
  },
  "verify_wallet_screen": {
    "title": "वॉलेट सत्यापित करें",
    "generated_mnemonic": "आपका जेनरेट किया हुआ म्नेमोनिक: कृपया इसे सुरक्षित रखें और इसे दूसरों के साथ साझा न करें।",
    "confirm_backup": "वॉलेट बैकअप की पुष्टि करें",
    "enter_words": "अपने म्नेमोनिक से 4 शब्द दर्ज करें",
    "cancel": "रद्द करें",
    "verify": "सत्यापित करें"
  },
  "wallet_selector_screen": {
    "create_wallet": "नया वॉलेट बनाएं",
    "import_mnemonic": "म्नेमोनिक आयात करें",
    "remove_wallet": "वॉलेट हटाएं",
    "welcome_to": "स्वागत है",
    "app_title": "Kittyrun Wallet",
    "selection_text": "कृपया म्नेमोनिक बनाने या आयात करने के लिए नीचे एक विकल्प चुनें"
  },
  "import_seed_screen": {
    "import_seed_phrase": "सीड फ्रेज़ आयात करें",
    "import_seed_and_save_wallet": "सीड फ्रेज़ आयात करें और वॉलेट सहेजें"
  },
  "wallet_screen": {
    "backup_wallet": "वॉलेट का बैकअप लें",
    "restore_wallet": "वॉलेट पुनर्स्थापित करें",
    "enter_password": "अपने वॉलेट को पुनर्स्थापित करने के लिए अपना पासवर्ड दर्ज करें:",
    "restore_wallet_description": "आपने अपने वॉलेट का बैकअप नहीं लिया है। आपको अपने संपत्ति की सुरक्षा के लिए 12 म्नेमोनिक शब्दों को सुरक्षित रखना होगा।",
    "later": "बाद में",
    "confirm": "पुष्टि करें",
    "backup_successful": "बैकअप सफल रहा",
    "mnemonic_validation_failed": "म्नेमोनिक सत्यापन विफल",
    "submit": "जमा करें",
    "cancel": "रद्द करें",
    "word_at_position": "स्थान पर शब्द",
    "validate": "सत्यापित करें"
  },
  "backup_dialog": {
    "title": "वॉलेट का बैकअप लें",
    "description": "आपको अपने वॉलेट का बैकअप लेने की आवश्यकता है ताकि आपकी संपत्ति सुरक्षित रहे। म्नेमोनिक शब्दों को लिख लेना सुनिश्चित करें।",
    "later": "बाद में",
    "confirm": "पुष्टि करें",
    "validate": "सत्यापित करें",
    "mnemonic_error": "म्नेमोनिक सत्यापन विफल। कृपया पुनः प्रयास करें।",
    "backup_success": "बैकअप सफल रहा!",
    "i_have_written_mnemonic": "मैंने 12 म्नेमोनिक शब्द लिख लिए हैं",
    "enter_mnemonic_words": "कृपया उनके स्थानों के आधार पर निम्नलिखित शब्द दर्ज करें:",
    "word_at_position": "स्थान पर शब्द"
  }
}
