{
  "setup_pin_screen": {
    "enter_your_pin": "กรุณาใส่รหัส PIN ของคุณ",
    "enter_your_pin_restore": "กรุณาใส่รหัส PIN เพื่อกู้คืนกระเป๋าเงิน",
    "enter_your_pin_create": "กรุณาใส่รหัส PIN เพื่อสร้างกระเป๋าเงินใหม่",
    "enter_your_pin_unlock": "กรุณาใส่รหัส PIN เพื่อปลดล็อกกระเป๋าเงิน",
    "reenter_your_pin": "กรุณาใส่รหัส PIN ของคุณอีกครั้ง",
    "pin_mismatch": "รหัส PIN ไม่ตรงกัน กรุณาลองใหม่อีกครั้ง",
    "failed_to_unlock": "ปลดล็อกกระเป๋าเงินไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
    "failed_to_create": "สร้างกระเป๋าเงินไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
    "failed_to_restore": "กู้คืนกระเป๋าเงินไม่สำเร็จ กรุณาลองใหม่อีกครั้ง",
    "unlocking_wallet": "กำลังปลดล็อกกระเป๋าเงิน...",
    "creating_wallet": "กำลังสร้างกระเป๋าเงิน กรุณารอสักครู่...",
    "restoring_wallet": "กำลังกู้คืนกระเป๋าเงิน กรุณารอสักครู่...",
    "confirm_wallet_deletion": "ยืนยันการลบกระเป๋าเงิน",
    "delete_wallet_warning": "คุณแน่ใจหรือไม่ว่าต้องการลบกระเป๋าเงินนี้? การดำเนินการนี้ไม่สามารถย้อนกลับได้",
    "cancel": "ยกเลิก",
    "delete": "ลบ",
    "remove_wallet": "ลบกระเป๋าเงิน"
  },
  "terms_screen": {
    "title": "ข้อกำหนดการใช้งาน",
    "terms_content": "KittyRun Wallet - ข้อกำหนดและเงื่อนไข\n\n1. **ลักษณะการกระจายอำนาจ**: KittyRun Wallet เป็นกระเป๋าเงินที่ไม่ต้องมีตัวกลาง (non-custodial) ซึ่งหมายความว่าคุณ, ผู้ใช้งาน, เป็นผู้รับผิดชอบในการจัดการคีย์ส่วนตัวและคำกู้คืนของคุณเอง เราไม่ได้จัดเก็บ, ควบคุม, หรือเข้าถึงคีย์ส่วนตัวหรือเงินของคุณ\n\n2. **ความเป็นส่วนตัว**: ในฐานะกระเป๋าเงินที่กระจายอำนาจ KittyRun Wallet ไม่เก็บรวบรวมหรือจัดเก็บข้อมูลส่วนบุคคลหรือข้อมูลธุรกรรมใด ๆ ข้อมูลทั้งหมดของคุณจะถูกจัดเก็บไว้ในอุปกรณ์ของคุณโดยไม่มีการส่งข้อมูลไปยังเซิร์ฟเวอร์ของเรา\n\n3. **การจัดการตนเอง**: คุณเป็นเจ้าของสินทรัพย์ของคุณแต่เพียงผู้เดียว หากคุณทำคีย์ส่วนตัวหรือคำกู้คืนสูญหาย คุณจะไม่สามารถเข้าถึงเงินของคุณได้ ความรับผิดชอบในการจัดเก็บและสำรองข้อมูลคำกู้คืนและคีย์ส่วนตัวของคุณเป็นของคุณเอง\n\n4. **ความรับผิดชอบในธุรกรรม**: ทุกธุรกรรมที่ดำเนินการผ่าน KittyRun Wallet จะไม่สามารถย้อนกลับได้ และคุณเป็นผู้รับผิดชอบในการตรวจสอบรายละเอียดธุรกรรมก่อนที่จะยืนยัน\n\n5. **ความปลอดภัย**: KittyRun Wallet ใช้การเข้ารหัสมาตรฐานอุตสาหกรรมเพื่อปกป้องข้อมูลของคุณบนอุปกรณ์ อย่างไรก็ตาม ความปลอดภัยของกระเป๋าเงินยังขึ้นอยู่กับความปลอดภัยของอุปกรณ์ของคุณ คุณมีหน้าที่รับผิดชอบในการปกป้องอุปกรณ์ของคุณจากการเข้าถึงโดยไม่ได้รับอนุญาต, มัลแวร์, และภัยคุกคามความปลอดภัยอื่น ๆ\n\n6. **การอัปเดต**: เราอาจออกการอัปเดตเพื่อปรับปรุงความปลอดภัย, แก้ไขข้อผิดพลาด, หรือเพิ่มคุณสมบัติใหม่ แนะนำให้คุณอัปเดตแอปพลิเคชันให้เป็นเวอร์ชันล่าสุดเพื่อให้มั่นใจในประสิทธิภาพและความปลอดภัยที่ดีที่สุด\n\n7. **ไม่มีความรับผิดชอบ**: KittyRun Wallet และผู้พัฒนาไม่รับผิดชอบต่อการสูญเสีย, ความเสียหาย, หรือค่าใช้จ่ายใด ๆ ที่เกิดจากการใช้งานหรือไม่สามารถใช้งานกระเป๋าเงินได้ รวมถึงแต่ไม่จำกัดเพียงการสูญเสียเงิน, การละเมิดข้อมูล, หรือการเข้าถึงอุปกรณ์ของคุณโดยไม่ได้รับอนุญาต\n\n8. **การยอมรับข้อกำหนด**: การใช้ KittyRun Wallet ถือว่าคุณได้อ่าน, เข้าใจ, และยอมรับข้อกำหนดเหล่านี้ หากคุณไม่ยอมรับข้อกำหนดใด ๆ กรุณาหยุดใช้งานกระเป๋าเงินทันที",
    "agree_to_terms": "ฉันยอมรับข้อกำหนดการใช้งาน",
    "accept_button": "ยอมรับ"
  },
  "wallet_choice_screen": {
    "title": "การตั้งค่ากระเป๋าเงิน",
    "choose_option": "เลือกตัวเลือกเพื่อเริ่มต้นการตั้งค่ากระเป๋าเงินของคุณ:",
    "create_new_wallet": "สร้างกระเป๋าเงินใหม่",
    "import_mnemonic": "นำเข้าคำกู้คืน"
  },
  "import_mnemonic_screen": {
    "title": "นำเข้าคำกู้คืน",
    "enter_mnemonic": "กรุณาใส่คำกู้คืน 12 คำของคุณ:",
    "mnemonic_error": "คำกู้คืนไม่ถูกต้อง กรุณาใส่ให้ครบ 12 คำ",
    "continue_button": "ดำเนินการต่อ"
  },
  "verify_wallet_screen": {
    "title": "ยืนยันกระเป๋าเงิน",
    "generated_mnemonic": "คำกู้คืนของคุณ: กรุณาบันทึกไว้อย่างปลอดภัยและอย่าเปิดเผยให้ผู้อื่นทราบ",
    "confirm_backup": "ยืนยันการสำรองข้อมูลกระเป๋าเงิน",
    "enter_words": "กรุณาใส่คำ 4 คำจากคำกู้คืนของคุณ",
    "cancel": "ยกเลิก",
    "verify": "ยืนยัน"
  },
  "wallet_selector_screen": {
    "create_wallet": "สร้างกระเป๋าเงินใหม่",
    "import_mnemonic": "นำเข้าคำกู้คืน",
    "remove_wallet": "ลบกระเป๋าเงิน",
    "welcome_to": "ยินดีต้อนรับสู่",
    "app_title": "Kittyrun Wallet",
    "selection_text": "กรุณาเลือกด้านล่างเพื่อสร้างหรือนำเข้าคำกู้คืน"
  },
  "import_seed_screen": {
    "import_seed_phrase": "นำเข้าคำกู้คืน",
    "import_seed_and_save_wallet": "นำเข้าคำกู้คืนและบันทึกกระเป๋าเงิน"
  },
  "wallet_screen": {
    "backup_wallet": "สำรองข้อมูลกระเป๋าเงิน",
    "restore_wallet": "กู้คืนกระเป๋าเงิน",
    "enter_password": "กรุณาใส่รหัสผ่านของคุณเพื่อเริ่มกู้คืนกระเป๋าเงิน:",
    "restore_wallet_description": "คุณยังไม่ได้สำรองข้อมูลกระเป๋าเงินของคุณ คุณต้องบันทึกคำกู้คืน 12 คำเพื่อปกป้องสินทรัพย์ของคุณ",
    "later": "ภายหลัง",
    "confirm": "ยืนยัน",
    "backup_successful": "การสำรองข้อมูลสำเร็จ",
    "mnemonic_validation_failed": "การตรวจสอบคำกู้คืนล้มเหลว",
    "submit": "ส่ง",
    "cancel": "ยกเลิก",
    "word_at_position": "คำที่ตำแหน่ง",
    "validate": "ตรวจสอบ"
  },
  "backup_dialog": {
    "title": "สำรองข้อมูลกระเป๋าเงิน",
    "description": "คุณต้องสำรองข้อมูลกระเป๋าเงินของคุณเพื่อปกป้องสินทรัพย์ของคุณ อย่าลืมจดคำกู้คืน",
    "later": "ภายหลัง",
    "confirm": "ยืนยัน",
    "validate": "ตรวจสอบ",
    "mnemonic_error": "การตรวจสอบคำกู้คืนล้มเหลว กรุณาลองใหม่อีกครั้ง",
    "backup_success": "การสำรองข้อมูลสำเร็จ!",
    "i_have_written_mnemonic": "ฉันได้จดคำกู้คืนทั้ง 12 คำเรียบร้อยแล้ว",
    "enter_mnemonic_words": "กรุณาใส่คำตามตำแหน่งที่ระบุ:",
    "word_at_position": "คำที่ตำแหน่ง"
  }
}
